_drafts/2018-01-30-ternary-operator.html
<p>
对于以前三元操作符的 <code>(x &lt; y and [x] or [y])[0]</code> 理解：
</p>

<p>
优先级顺序： <code>比较运算 &gt; not &gt; and &gt; or</code>
</p>

<p>
因此首先计算 x&lt;y:
</p>
<ul class="org-ul">
<li>如果是 True，即 True and [x] 结果为 [x]，[x] or [y]=[x]，则 [x][0]=x（输出列表的第一个元素）</li>
<li>如果是 False，即 False and [x]=False，False or [y]=[y]，[y][0]=y。实现的功能是 x if x &lt; y else y，即三元操作。</li>
</ul>

<p>
而 (x &lt; y and [x] or [y])[0] 为何不采用 x &lt;y and x or y 呢？
</p>

<p>
若采用 x &lt; y and x or y，则当 x=0，y&gt;0 时，x &lt;y and x =0（带入 x, y 即 True and 0）；接下来执行 or 操作，0 or y 结果为 y，使结果出错（我们意图这个表达式能有三元操作符 -&#x2014;x if x &lt; y else y 的效果，所以在 x = 0, y&gt; 0 时我们想要得到结果 x），故而采用列表的形式。
</p>

<hr />
<p>
现在的三元操作符为： <code>x if x &lt; y else y</code>
</p>

<p>
一个三元操作符使用的例子
</p>

<p>
请将以下代码修改为三元操作符实现：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">x</span>, <span style="color: #a0522d;">y</span>, <span style="color: #a0522d;">z</span> = 6, 5, 4
<span style="color: #a020f0;">if</span> x &lt; y:
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">small</span> = x
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">if</span> z &lt; small:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">small</span> = z
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">elif</span> y &lt; z:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">small</span> = y
<span style="background-color: #f2f2f2;"> </span>   <span style="color: #a020f0;">else</span>:
<span style="background-color: #f2f2f2;"> </span>   <span style="background-color: #f2f2f2;"> </span>   <span style="color: #a0522d;">small</span> = z      <span style="color: #b22222;">#</span><span style="color: #b22222;">&#27492;&#27573;&#20195;&#30721;&#26159;&#25214;&#21040;x, y, z&#30340;&#26368;&#23567;&#20540; </span>
</pre>
</div>


<p>
实现结果：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">small</span> = x <span style="color: #a020f0;">if</span> (x &lt; y <span style="color: #a020f0;">and</span> x &lt; z) <span style="color: #a020f0;">else</span> (y <span style="color: #a020f0;">if</span> y &lt; z <span style="color: #a020f0;">else</span> z)
</pre>
</div>
